from commands import CommandType

start = '''Вітаємо, це бот для пропозицій до співпраці з УСЛ.

Тут ви зможете запропонувати нам пропозицію до співпраці, проєкт або ж запросити медійну підтримку. 

Творимо кращий час разом!'''


commands = {
    CommandType.Project: [
        'Надайте короткий опис проєкту (5-10 речень).',
        'Сформулюйте Ціль проєкту (2-3 речення).',
        'Опишіть необхідні ресурси УСЛу, які потрібні Вам для реалізації проєкту.\n'
        'Наприклад: юридична консультація, допомога відділу HR, '
        'допомога у залученні інших університетів, фінансування, залучення людей до організації проєкту.',
        'Точки дотику з УСЛ, чому проєкт є корисним для вас та спільноти УСЛ?'
        'Наприклад: спільна медійна компанія, залученість колегіантів у ролі спікерів і тд.'
    ],
    CommandType.MediaSupport: [
        'Якого роду медійну співпрацю ви хочете запропонувати?',
        'Надішліть посилання на додаткову інформацію та матеріали для поширення',
    ],
    CommandType.Appeal: [
        "Напишіть свої думки про УСЛ, ми обов'язково Вас почуємо :)."
    ]
}


command_end = 'Дякуємо, ми розглянемо вашу заявку та невдовзі ви отримаєте відповідь.'
